#include <stdio.h>

int main() { 
    int i = 2;  //กำหนดค่าตัวแปร i
    while (i <= 10)  // ใช้ while loop สร้างเงื่อนไข i <= 10
    {
        printf("%d ",i); // แสดงผล i
        i = i+2 ; // นำ i + 2 จนกว่าจะหลุดเงื่อนไข
    }
    printf("\n");
    printf("End of loop"); //แสดงผล End of loop 
   
    return 0;
    

}               
        // กำหนดค่า i = 2
        // while loop กำหนดเงื่อนไข i <= 10 // i เริ่มต้นเป็น 2 ยังไม่หลุดจากเงื่อนไข 
        // printf i ออกมา 
        // นำ i + 2 
        // แล้วนำ i ไปเช็คในเงื่อนไข 
        // ทำวนซ้ำไปเรื่อยๆ จำหลุดเงื่อนไข