#include <stdio.h>

int main() {
    for (int i = 2; i <= 10; i=i+2)  // ใช้ for loop กำหนด ค่าเริ่มต้น i กำหนด condition และ update
    {
         printf("%d ",i);  // แสดงค่า i 
    }
    printf("\n");  //เว้นบรรทัด
    printf("End of loop");  //แสดงค่า End of loop
    
    return 0;  
}


    // for loop กำหนดค่าเริ่มต้นตัวแปร สร้างเงื่อนไข i <= 10 และอัปเดต i = i+2
    //โดย i = 2 แล้วนำไปตรวจสอบเงื่อนไข ถ้าหากยังไม่หลุดจากเงื่อนไข ก็นำ i + 2 แล้วนำไปตรวจสอบเงื่อนไข 
    //วนซ้ำไปเรื่อยๆ จนหลุดจากเงื่อนไข